app/controllers/detalle_ventas_controller.rb

SELECT `detalle_ventas`.* FROM `detalle_ventas`
---
  def index
    @detalle_ventas = DetalleVenta.all