app/controllers/ventas_controller.rb

  def index
    @ventas = Venta.all
---
SELECT `ventas`.* FROM `ventas`

  def show
    @venta = Venta.find(params[:id])
---
SELECT `ventas`.* FROM `ventas` WHERE `ventas`.`id` = 1 LIMIT 1

  def edit
    @venta = Venta.find(params[:id])
---
SELECT `ventas`.* FROM `ventas` WHERE `ventas`.`id` = 6 LIMIT 1

  def create
    @venta = Venta.new(params[:venta])

    @venta.importe = 0.0

    @venta.detalle_ventas.each do |dv|
      @venta.importe = @venta.importe + dv.precio_unitario * dv.cantidad
    end

    respond_to do |format|
      if @venta.save
---
INSERT INTO `detalle_ventas` (`cantidad`, `created_at`, `precio_unitario`, `producto_id`, `updated_at`, `venta_id`) VALUES (1, '2013-01-07 21:13:55', 350.0, NULL, '2013-01-07 21:13:55', 1)
INSERT INTO `ventas` (`cliente_id`, `created_at`, `fecha`, `importe`, `updated_at`) VALUES (1, '2013-01-10 15:20:45', '2013-01-10', NULL, '2013-01-10 15:20:45')

  def update
    @venta = Venta.find(params[:id])

    respond_to do |format|
      @venta.importe = 0.0
      @venta.detalle_ventas.each do |dv|
         @venta.importe = @venta.importe + dv.precio_unitario * dv.cantidad
      end
      if @venta.update_attributes(params[:venta])
---
SELECT `ventas`.* FROM `ventas` WHERE `ventas`.`id` = 6 LIMIT 1
SELECT `detalle_ventas`.* FROM `detalle_ventas` WHERE `detalle_ventas`.`venta_id` = 8 AND `detalle_ventas`.`id` IN (12, 13, 14)
SELECT `ventas`.* FROM `ventas` ORDER BY `ventas`.`id` DESC LIMIT 1
UPDATE `detalle_ventas` SET `cantidad` = 1, `precio_unitario` = 350.0, `updated_at` = '2013-01-11 11:26:35' WHERE `detalle_ventas`.`id` = 13
UPDATE `ventas` SET `importe` = 320.0, `updated_at` = '2013-01-11 00:07:51' WHERE `ventas`.`id` = 6

  def destroy
    @venta = Venta.find(params[:id])
    @venta.destroy
---
SELECT `ventas`.* FROM `ventas` WHERE `ventas`.`id` = 1 LIMIT 1
DELETE FROM `ventas` WHERE `ventas`.`id` = 1