app/views/ventas/_form.html.erb

SELECT `clientes`.* FROM `clientes`
---
    <%= f.label :cliente_id %><br />
    <%= collection_select(:venta, :cliente_id, Cliente.all, :id, :to_s, :prompt => true) %>

SELECT `productos`.* FROM `productos`
---
		  			<p>
		  				<%= dv.collection_select(:producto_id, Producto.all, :id, :to_s, :prompt => true)%>