app/views/ventas/show.html.erb

  <ul>
	  <% @venta.detalle_ventas.each do |dv| %>
---
SELECT `detalle_ventas`.* FROM `detalle_ventas` WHERE `detalle_ventas`.`venta_id` = 1